TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2s.h
/* I2S_PWREN Bits */
/* I2S_PWREN[ENABLE] Bits */
#define I2S_PWREN_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define I2S_PWREN_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< Enable the power */
#define I2S_PWREN_ENABLE_DISABLE                 ((uint32_t)0x00000000U)         /* !< Disable Power */
#define I2S_PWREN_ENABLE_ENABLE                  ((uint32_t)0x00000001U)         /* !< Enable Power */
/* I2S_PWREN[KEY] Bits */
#define I2S_PWREN_KEY_OFS                        (24)                            /* !< KEY Offset */
#define I2S_PWREN_KEY_MASK                       ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define I2S_PWREN_KEY_UNLOCK_W                   ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2S_RSTCTL Bits */
/* I2S_RSTCTL[RESETSTKYCLR] Bits */
#define I2S_RSTCTL_RESETSTKYCLR_OFS              (1)                             /* !< RESETSTKYCLR Offset */
#define I2S_RSTCTL_RESETSTKYCLR_MASK             ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define I2S_RSTCTL_RESETSTKYCLR_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_RSTCTL_RESETSTKYCLR_CLR              ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* I2S_RSTCTL[RESETASSERT] Bits */
#define I2S_RSTCTL_RESETASSERT_OFS               (0)                             /* !< RESETASSERT Offset */
#define I2S_RSTCTL_RESETASSERT_MASK              ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define I2S_RSTCTL_RESETASSERT_NOP               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_RSTCTL_RESETASSERT_ASSERT            ((uint32_t)0x00000001U)         /* !< Assert reset */
/* I2S_RSTCTL[KEY] Bits */
#define I2S_RSTCTL_KEY_OFS                       (24)                            /* !< KEY Offset */
#define I2S_RSTCTL_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define I2S_RSTCTL_KEY_UNLOCK_W                  ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* I2S_CLKCFG Bits */
/* I2S_CLKCFG[KEY] Bits */
#define I2S_CLKCFG_KEY_OFS                       (24)                            /* !< KEY Offset */
#define I2S_CLKCFG_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define I2S_CLKCFG_KEY_UNLOCK                    ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* I2S_CLKCFG[BLOCKASYNC] Bits */
#define I2S_CLKCFG_BLOCKASYNC_OFS                (8)                             /* !< BLOCKASYNC Offset */
#define I2S_CLKCFG_BLOCKASYNC_MASK               ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define I2S_CLKCFG_BLOCKASYNC_DISABLE            ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define I2S_CLKCFG_BLOCKASYNC_ENABLE             ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* I2S_GPRCM_STAT Bits */
/* I2S_GPRCM_STAT[RESETSTKY] Bits */
#define I2S_GPRCM_STAT_RESETSTKY_OFS             (16)                            /* !< RESETSTKY Offset */
#define I2S_GPRCM_STAT_RESETSTKY_MASK            ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define I2S_GPRCM_STAT_RESETSTKY_NORES           ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define I2S_GPRCM_STAT_RESETSTKY_RESET           ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* I2S_PDBGCTL Bits */
/* I2S_PDBGCTL[FREE] Bits */
#define I2S_PDBGCTL_FREE_OFS                     (0)                             /* !< FREE Offset */
#define I2S_PDBGCTL_FREE_MASK                    ((uint32_t)0x00000001U)         /* !< Free run control */
#define I2S_PDBGCTL_FREE_STOP                    ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define I2S_PDBGCTL_FREE_RUN                     ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* I2S_PDBGCTL[SOFT] Bits */
#define I2S_PDBGCTL_SOFT_OFS                     (1)                             /* !< SOFT Offset */
#define I2S_PDBGCTL_SOFT_MASK                    ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define I2S_PDBGCTL_SOFT_IMMEDIATE               ((uint32_t)0x00000000U)         /* !< The peripheral will halt
                                                                                    immediately, even if the resultant
                                                                                    state will result in corruption if
                                                                                    the system is restarted */
#define I2S_PDBGCTL_SOFT_DELAYED                 ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* I2S_INTCTL Bits */
/* I2S_INTCTL[INTEVAL] Bits */
#define I2S_INTCTL_INTEVAL_OFS                   (0)                             /* !< INTEVAL Offset */
#define I2S_INTCTL_INTEVAL_MASK                  ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define I2S_INTCTL_INTEVAL_DISABLE               ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define I2S_INTCTL_INTEVAL_EVAL                  ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* I2S_FMTCFG Bits */
/* I2S_FMTCFG[WORDLEN] Bits */
#define I2S_FMTCFG_WORDLEN_OFS                   (0)                             /* !< WORDLEN Offset */
#define I2S_FMTCFG_WORDLEN_MASK                  ((uint32_t)0x0000001FU)         /* !< Number of bits per word (8-32): In
                                                                                    single-phase format, this is the
                                                                                    exact number of bits per word.  In
                                                                                    dual-phase format, this is the
                                                                                    maximum number of bits per word.
                                                                                    Values below 8 and above 32 give
                                                                                    undefined behavior. Data written to
                                                                                    memory is always aligned to 16 or 32
                                                                                    bits as defined by [MEMLEN32]. Bit
                                                                                    widths that differ from this
                                                                                    alignment will either be truncated or
                                                                                    zero padded. */
/* I2S_FMTCFG[DUALPHASE] Bits */
#define I2S_FMTCFG_DUALPHASE_OFS                 (5)                             /* !< DUALPHASE Offset */
#define I2S_FMTCFG_DUALPHASE_MASK                ((uint32_t)0x00000020U)         /* !< This field selects between
                                                                                    dual-phase or single-phase format */
#define I2S_FMTCFG_DUALPHASE_SINGLEPHASE         ((uint32_t)0x00000000U)         /* !< Single-phase: DSP format */
#define I2S_FMTCFG_DUALPHASE_DUALPHASE           ((uint32_t)0x00000020U)         /* !< Dual-phase: I2S**, **LJF and
                                                                                    RJF formats */
/* I2S_FMTCFG[SMPLEDGE] Bits */
#define I2S_FMTCFG_SMPLEDGE_OFS                  (6)                             /* !< SMPLEDGE Offset */
#define I2S_FMTCFG_SMPLEDGE_MASK                 ((uint32_t)0x00000040U)         /* !< This field configures the sample
                                                                                    edge/ transfer edge of data (and
                                                                                    WCLK**) on **BCLK */
#define I2S_FMTCFG_SMPLEDGE_NEGEDGE              ((uint32_t)0x00000000U)         /* !< Data is sampled on the negative
                                                                                    edge and clocked out on the positive
                                                                                    edge. */
#define I2S_FMTCFG_SMPLEDGE_POSEDGE              ((uint32_t)0x00000040U)         /* !< Data is sampled on the positive
                                                                                    edge and clocked out on the negative
                                                                                    edge. */
/* I2S_FMTCFG[MEMLEN32] Bits */
#define I2S_FMTCFG_MEMLEN32_OFS                  (7)                             /* !< MEMLEN32 Offset */
#define I2S_FMTCFG_MEMLEN32_MASK                 ((uint32_t)0x00000080U)         /* !< This register configures the size
                                                                                    of each word stored to or loaded from
                                                                                    memory */
#define I2S_FMTCFG_MEMLEN32_16BIT                ((uint32_t)0x00000000U)         /* !< 16-bit (one 16 bit access per
                                                                                    sample) */
#define I2S_FMTCFG_MEMLEN32_32BIT                ((uint32_t)0x00000080U)         /* !< 32-bit(one 32-bit access per
                                                                                    sample) */
/* I2S_FMTCFG[DATADLY] Bits */
#define I2S_FMTCFG_DATADLY_OFS                   (8)                             /* !< DATADLY Offset */
#define I2S_FMTCFG_DATADLY_MASK                  ((uint32_t)0x0000FF00U)         /* !< This field configures the number of
                                                                                    BCLK** periods between a **WCLK
                                                                                    edge and MSB of the first word in
                                                                                    a phase  Note: When 0, MSB of the
                                                                                    next word will be output in the idle
                                                                                    period between LSB of the
                                                                                    previous word and the start of the
                                                                                    next word. Otherwise logical 0 will
                                                                                    be output until the data delay has
                                                                                    expired. */
#define I2S_FMTCFG_DATADLY_ZERO                  ((uint32_t)0x00000000U)         /* !< Zero BCLK** periods - **LJF and
                                                                                    DSP formats */
#define I2S_FMTCFG_DATADLY_ONE                   ((uint32_t)0x00000100U)         /* !< One BCLK** periods - **I2S and
                                                                                    DSP formats */
#define I2S_FMTCFG_DATADLY_TWO                   ((uint32_t)0x00000200U)         /* !< Two(Min) BCLK** periods - **RJF
                                                                                    format */
#define I2S_FMTCFG_DATADLY_MAX                   ((uint32_t)0x0000FF00U)         /* !< Max(255) BCLK** periods - **RJF
                                                                                    format */
/* I2S_FMTCFG[SUSPEND] Bits */
#define I2S_FMTCFG_SUSPEND_OFS                   (24)                            /* !< SUSPEND Offset */
#define I2S_FMTCFG_SUSPEND_MASK                  ((uint32_t)0x01000000U)         /* !< Suspend external communication */
#define I2S_FMTCFG_SUSPEND_DISABLE               ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define I2S_FMTCFG_SUSPEND_ENABLE                ((uint32_t)0x01000000U)         /* !< External communication suspended */
/* I2S_FMTCFG[ENABLE] Bits */
#define I2S_FMTCFG_ENABLE_OFS                    (31)                            /* !< ENABLE Offset */
#define I2S_FMTCFG_ENABLE_MASK                   ((uint32_t)0x80000000U)         /* !< I2S Module Enable.       If the I2S
                                                                                    is disabled in the middle of
                                                                                    transmission or reception, it
                                                                                    completes the current character
                                                                                    before stopping.      If ENABLE bit
                                                                                    is not set, all registers can still
                                                                                    be accessed and updated. It is
                                                                                    recommended to setup and change I2S
                                                                                    operation mode whhile ENABLE bit is
                                                                                    cleared to avoid unpredictable
                                                                                    behavior during setup or update.
                                                                                    If disabled,  I2S module will not
                                                                                    send or receive any data. */
#define I2S_FMTCFG_ENABLE_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable Module */
#define I2S_FMTCFG_ENABLE_ENABLE                 ((uint32_t)0x80000000U)         /* !< Enable module */
/* I2S_FMTCFG[EMPTYSLOTOUTPUT] Bits */
#define I2S_FMTCFG_EMPTYSLOTOUTPUT_OFS           (16)                            /* !< EMPTYSLOTOUTPUT Offset */
#define I2S_FMTCFG_EMPTYSLOTOUTPUT_MASK          ((uint32_t)0x00030000U)         /* !< The field configures the
                                                                                    EMPTYSLOTOUTPUT data pin
                                                                                    direction */
#define I2S_FMTCFG_EMPTYSLOTOUTPUT_ZERO          ((uint32_t)0x00000000U)         /* !< Send out zeroes in empty slots */
#define I2S_FMTCFG_EMPTYSLOTOUTPUT_ONE           ((uint32_t)0x00010000U)         /* !< send out ones in empty slot */
#define I2S_FMTCFG_EMPTYSLOTOUTPUT_TRISTATE      ((uint32_t)0x00020000U)         /* !< Tristate line during empty slot */

/* I2S_CLKCTL Bits */
/* I2S_CLKCTL[WBEN] Bits */
#define I2S_CLKCTL_WBEN_OFS                      (0)                             /* !< WBEN Offset */
#define I2S_CLKCTL_WBEN_MASK                     ((uint32_t)0x00000001U)         /* !< This field configures
                                                                                    WCLK/BCLK generation */
#define I2S_CLKCTL_WBEN_DIS                      ((uint32_t)0x00000000U)         /* !< Disables the generation */
#define I2S_CLKCTL_WBEN_EN                       ((uint32_t)0x00000001U)         /* !< Enable the generation */
/* I2S_CLKCTL[WCLKPHASE] Bits */
#define I2S_CLKCTL_WCLKPHASE_OFS                 (1)                             /* !< WCLKPHASE Offset */
#define I2S_CLKCTL_WCLKPHASE_MASK                ((uint32_t)0x00000006U)         /* !< The field configures how the WCLK
                                                                                    division ratio is calculated and used
                                                                                    to generate different duty cycles
                                                                                    (See [WCLKDIV.WDIV]) */
/* I2S_CLKCTL[MEN] Bits */
#define I2S_CLKCTL_MEN_OFS                       (3)                             /* !< MEN Offset */
#define I2S_CLKCTL_MEN_MASK                      ((uint32_t)0x00000008U)         /* !< This field configures the MCLK
                                                                                    generation */
#define I2S_CLKCTL_MEN_DIS                       ((uint32_t)0x00000000U)         /* !< Disable the generation */
#define I2S_CLKCTL_MEN_EN                        ((uint32_t)0x00000008U)         /* !< Enable the generation */

