TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2s.h
/* I2S_WMASK1 Bits */
/* I2S_WMASK1[MASK] Bits */
#define I2S_WMASK1_MASK_OFS                      (0)                             /* !< MASK Offset */
#define I2S_WMASK1_MASK_MASK                     ((uint32_t)0x000000FFU)         /* !< Bit-mask indicating valid channels
                                                                                    in a frame on AD1.  In single-phase
                                                                                    mode, each bit represents one
                                                                                    channel, starting with LSB for
                                                                                    the first word in the frame. A frame
                                                                                    can contain up to 8 channels.
                                                                                    Channels that are not included in the
                                                                                    mask will not be sampled and stored
                                                                                    in memory, and clocked out as '0'.
                                                                                    In dual-phase mode, only the two
                                                                                    LSBs are considered. For a stereo
                                                                                    configuration, set both bits. For a
                                                                                    mono configuration, set bit 0 only.
                                                                                    In mono mode, only channel 0 will be
                                                                                    sampled and stored to memory, and
                                                                                    channel 0 will be repeated when
                                                                                    clocked out.  In mono mode, only
                                                                                    channel 0 will be sampled and stored
                                                                                    to memory, and channel 0 will be
                                                                                    repeated in the second phase when
                                                                                    clocked out.  If all bits are zero,
                                                                                    no input words will be stored to
                                                                                    memory, and the output data lines
                                                                                    will be constant '0'. This can be
                                                                                    utilized when PWM debug output is
                                                                                    desired without any actively used
                                                                                    output pins. */

/* I2S_MCLKDIV Bits */
/* I2S_MCLKDIV[MDIV] Bits */
#define I2S_MCLKDIV_MDIV_OFS                     (0)                             /* !< MDIV Offset */
#define I2S_MCLKDIV_MDIV_MASK                    ((uint32_t)0x000003FFU)         /* !< An unsigned factor of the division
                                                                                    ratio used to generate MCLK
                                                                                    [2-1024]:
                                                                                    MCLK =
                                                                                    MCUCLK/MDIV[Hz] MCUCLK is upto
                                                                                    96MHz.
                                                                                    A value of 0 is
                                                                                    interpreted as 1024.
                                                                                    A value of
                                                                                    1 is invalid.
                                                                                    If MDIV is odd
                                                                                    the low phase of the clock is one
                                                                                    MCUCLK period longer than the
                                                                                    high phase. */

/* I2S_WCLKDIV Bits */
/* I2S_WCLKDIV[WDIV] Bits */
#define I2S_WCLKDIV_WDIV_OFS                     (0)                             /* !< WDIV Offset */
#define I2S_WCLKDIV_WDIV_MASK                    ((uint32_t)0x0000FFFFU)         /* !< If[CLKCTL.WCLKPHASE]= 0, Single
                                                                                    phase. WCLKis high
                                                                                    one**BCLK**period and low WDIV[9:0]
                                                                                    (unsigned, [1-1023])**BCLK**periods.
                                                                                    
                                                                                    WCLK**=**MCUCLK/
                                                                                    BDIV*(WDIV[9:0] + 1) [Hz]
                                                                                    MCUCLKupto 96MHz.
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*]= 1, Dual
                                                                                    phase. Each phase on**WCLK**(50% duty
                                                                                    cycle) is WDIV[9:0] (unsigned,
                                                                                    [1-1023])**BCLK**periods.
                                                                                    
                                                                                    WCLK**=**MCUCLK/
                                                                                    BDIV*(2*WDIV[9:0]) [Hz]
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*] = 2, User
                                                                                    defined. WCLKis high WDIV[7:0]
                                                                                    (unsigned, [1-255])**BCLK**periods
                                                                                    and low WDIV[15:8] (unsigned,
                                                                                    [1-255])**BCLK**periods.
                                                                                    
