TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_i2s.h
                                                                                    WCLK**=**MCUCLK/ (BDIV*(WDIV[7:0]
                                                                                    + WDIV[15:8]) [Hz] */

/* I2S_BCLKDIV Bits */
/* I2S_BCLKDIV[BDIV] Bits */
#define I2S_BCLKDIV_BDIV_OFS                     (0)                             /* !< BDIV Offset */
#define I2S_BCLKDIV_BDIV_MASK                    ((uint32_t)0x000003FFU)         /* !< An unsigned factor of the division
                                                                                    ratio used to generate BCLK
                                                                                    [2-1024]:
                                                                                    BCLK =
                                                                                    MCUCLK/BDIV[Hz] MCUCLK can be
                                                                                    upto 96MHz.
                                                                                    A value of 0 is
                                                                                    interpreted as 1024.
                                                                                    A value of
                                                                                    1 is invalid.
                                                                                    If BDIV is odd
                                                                                    and [FMTCFG.SMPLEDGE] = 0, the low
                                                                                    phase of the clock is one MCUCLK
                                                                                    period longer than the high phase.
                                                                                    
                                                                                    If BDIV is odd and
                                                                                    [FMTCFG.SMPLEDGE] = 1 , the high
                                                                                    phase of the clock is one MCUCLK
                                                                                    period longer than the low phase. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_i2s__include */

